# St7GetVertexXYZ

Returns the position of the specified vertex.

long St7GetVertexXYZ(long uID, long VertexNum, double* XYZ)
Input Parameters
uID
Strand7 model file ID.
VertexNum
Vertex number.
Output Parameters
XYZ[0..2]
Vertex position as a 3-element array in global XYZ coordinates.